app/views/users/show.html.slim

ul
    - @user.messages.each do |message|
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" IN (3)