app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" IN (3)
---
    def show
        @user = User.includes(:messages).find(params[:id])